Revit 2026 API

# ConduitSizeSettingIterator Properties

---

The ConduitSizeSettingIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ConduitSizeSettingIterator Class

Autodesk.Revit.DB.Electrical Namespace